#+title: 12th level ligma charsheet
#+description: 12th level fairy run
#+FILETAGS: dnd stats ligma

* Abilities and Skills
  #+name: stats
  | Ability | Score | Mod | PB | Roll      | Skill           |
  |---------+-------+-----+----+-----------+-----------------|
  | STR     |     9 |  -1 |    | 1d20 + -1 | Saving Throw    |
  |         |       |     |    | 1d20 + -1 | Athletics       |
  |---------+-------+-----+----+-----------+-----------------|
  | DEX     |    16 |   3 |    | 1d20 + 3  | Saving Throw    |
  |         |       |     |    | 1d20 + 3  | Acrobatics      |
  |         |       |     |    | 1d20 + 3  | Sleight of Hand |
  |         |       |     |  7 | 1d20 + 3  | Stealth         |
  |---------+-------+-----+----+-----------+-----------------|
  | CON     |    19 |   4 |  8 | 1d20 + 4  | Saving Throw    |
  |---------+-------+-----+----+-----------+-----------------|
  | INT     |    11 |   0 |    | 1d20 + 0  | Saving Throw    |
  |         |       |     |    | 1d20 + 0  | Arcana          |
  |         |       |     |    | 1d20 + 0  | History         |
  |         |       |     |    | 1d20 + 0  | Investigation   |
  |         |       |     |    | 1d20 + 0  | Nature          |
  |         |       |     |    | 1d20 + 0  | Religion        |
  |---------+-------+-----+----+-----------+-----------------|
  | WIS     |    11 |   0 |    | 1d20 + 0  | Saving Throw    |
  |         |       |     |    | 1d20 + 0  | Animal Handling |
  |         |       |     |    | 1d20 + 0  | Insight         |
  |         |       |     |    | 1d20 + 0  | Medicine        |
  |         |       |     |    | 1d20 + 0  | Perception      |
  |         |       |     |    | 1d20 + 0  | Survival        |
  |---------+-------+-----+----+-----------+-----------------|
  | CHA     |    20 |   5 |  8 | 1d20 + 5  | Saving Throw    |
  |         |       |     |  8 | 1d20 + 5  | Deception       |
  |         |       |     |  8 | 1d20 + 5  | Intimidation    |
  |         |       |     |  0 | 1d20 + 5  | Performance     |
  |         |       |     |  8 | 1d20 + 5  | Persuasion      |
  |---------+-------+-----+----+-----------+-----------------|
  | PROF    |     4 |     |    |           |                 |
  #+TBLFM: @2$3='(calc-dnd-mod (string-to-number (org-table-get-constant $1)))
  #+TBLFM: @4$3='(calc-dnd-mod (string-to-number (org-table-get-constant $1)))
  #+TBLFM: @8$3='(calc-dnd-mod (string-to-number (org-table-get-constant $1)))
  #+TBLFM: @9$3='(calc-dnd-mod (string-to-number (org-table-get-constant $1)))
  #+TBLFM: @15$3='(calc-dnd-mod (string-to-number (org-table-get-constant $1)))
  #+TBLFM: @21$3='(calc-dnd-mod (string-to-number (org-table-get-constant $1)))
  #+TBLFM: @2$5..@3$5='(concat "1d20 + " (number-to-string (+ (calc-dnd-pb $PROF $4) (calc-dnd-mod (string-to-number (org-table-get-constant @2$1))))))
  #+TBLFM: @4$5..@7$5='(concat "1d20 + " (number-to-string (+ (calc-dnd-pb $PROF $4) (calc-dnd-mod (string-to-number (org-table-get-constant @4$1))))))
  #+TBLFM: @8$5..@8$5='(concat "1d20 + " (number-to-string (+ (calc-dnd-pb $PROF $4) (calc-dnd-mod (string-to-number (org-table-get-constant @8$1))))))
  #+TBLFM: @9$5..@14$5='(concat "1d20 + " (number-to-string (+ (calc-dnd-pb $PROF $4) (calc-dnd-mod (string-to-number (org-table-get-constant @9$1))))))
  #+TBLFM: @15$5..@20$5='(concat "1d20 + " (number-to-string (+ (calc-dnd-pb $PROF $4) (calc-dnd-mod (string-to-number (org-table-get-constant @15$1))))))
  #+TBLFM: @21$5..@25$5='(concat "1d20 + " (number-to-string (+ (calc-dnd-pb $PROF $4) (calc-dnd-mod (string-to-number (org-table-get-constant @21$1))))))

* Equipment
| Name                | Quantity | Cost (gp) | Weight (lbs) | Total Weight (lbs) | Total Cost (gp) |
|---------------------+----------+-----------+--------------+--------------------+-----------------|
| Light Crossbow      |        1 |        25 |            5 |                  5 |              25 |
| Crossbow bolts (20) |        2 |         1 |          1.5 |                  3 |              40 |
| Dagger              |        4 |         2 |            1 |                  4 |               8 |
| Arcane Focus, Orb   |        1 |        20 |            3 |                  3 |              20 |
| Backpack            |        1 |         2 |            5 |                  5 |               2 |
| Ball Bearings (1k)  |        2 |         1 |            2 |                  4 |               2 |
| Healer's Kit        |        1 |         5 |            3 |                  3 |               5 |
| Crowbar             |        1 |         2 |            5 |                  5 |               2 |
| Hammer              |        1 |         1 |            3 |                  3 |               1 |
| Piton               |       10 |       .05 |          .25 |                2.5 |             0.5 |
| Torch               |       10 |       .01 |            1 |                 10 |             0.1 |
| Tinderbox           |        1 |        .5 |            1 |                  1 |             0.5 |
| Ration              |       10 |        .5 |            2 |                 20 |              5. |
| Bedroll             |        1 |         1 |            2 |                  2 |               1 |
| Waterskin           |        1 |        .2 |            5 |                  5 |             0.2 |
| Hempen Rope (50ft)  |        1 |         1 |           10 |                 10 |               1 |
| Robes               |        1 |         1 |            4 |                  4 |               1 |
| Climbers Kit        |        1 |        25 |           12 |                 12 |              25 |
|---------------------+----------+-----------+--------------+--------------------+-----------------|
| Carry Capacity      |       90 |           |              |              148.5 |           124.3 |
#+TBLFM: $5=($2 * $4)
#+TBLFM: $6=($2 * $3)
#+TBLFM: @>$5=vsum(@<<$5..@>>$5)
#+TBLFM: @>$6=vsum(@<<$6..@>>$6)
#+TBLFM: @>$2=($STR * 10)

* Constants
  #+NAME: define-constants-with-src-block
  #+BEGIN_SRC elisp :var table=stats :colnames yes :results output drawer :cache yes :lang elisp
    (dnd-output-ability-constants table)
    #+END_SRC

    #+RESULTS[87ad1d0bfe6e86e226ace44824ec4d05b899ea9a]: define-constants-with-src-block
    :results:
    #+CONSTANTS: STR=9
    #+CONSTANTS: DEX=16
    #+CONSTANTS: CON=19
    #+CONSTANTS: INT=11
    #+CONSTANTS: WIS=11
    #+CONSTANTS: CHA=20
    #+CONSTANTS: PROF=4
    :end:

* Abilities and Skills
  #+name: stats
  | Ability | Score | Mod | PB | Roll      | Skill           |
  |---------+-------+-----+----+-----------+-----------------|
  | STR     |     9 |  -1 |    | 1d20 + -1 | Saving Throw    |
  |         |       |     |    | 1d20 + -1 | Athletics       |
  |---------+-------+-----+----+-----------+-----------------|
  | DEX     |    16 |   3 |    | 1d20 + 3  | Saving Throw    |
  |         |       |     |    | 1d20 + 3  | Acrobatics      |
  |         |       |     |    | 1d20 + 3  | Sleight of Hand |
  |         |       |     |  7 | 1d20 + 3  | Stealth         |
  |---------+-------+-----+----+-----------+-----------------|
  | CON     |    19 |   4 |  8 | 1d20 + 4  | Saving Throw    |
  |---------+-------+-----+----+-----------+-----------------|
  | INT     |    11 |   0 |    | 1d20 + 0  | Saving Throw    |
  |         |       |     |    | 1d20 + 0  | Arcana          |
  |         |       |     |    | 1d20 + 0  | History         |
  |         |       |     |    | 1d20 + 0  | Investigation   |
  |         |       |     |    | 1d20 + 0  | Nature          |
  |         |       |     |    | 1d20 + 0  | Religion        |
  |---------+-------+-----+----+-----------+-----------------|
  | WIS     |    11 |   0 |    | 1d20 + 0  | Saving Throw    |
  |         |       |     |    | 1d20 + 0  | Animal Handling |
  |         |       |     |    | 1d20 + 0  | Insight         |
  |         |       |     |    | 1d20 + 0  | Medicine        |
  |         |       |     |    | 1d20 + 0  | Perception      |
  |         |       |     |    | 1d20 + 0  | Survival        |
  |---------+-------+-----+----+-----------+-----------------|
  | CHA     |    20 |   5 |  8 | 1d20 + 5  | Saving Throw    |
  |         |       |     |  8 | 1d20 + 5  | Deception       |
  |         |       |     |  8 | 1d20 + 5  | Intimidation    |
  |         |       |     |  0 | 1d20 + 5  | Performance     |
  |         |       |     |  8 | 1d20 + 5  | Persuasion      |
  |---------+-------+-----+----+-----------+-----------------|
  | PROF    |     4 |     |    |           |                 |
  #+TBLFM: @2$3='(calc-dnd-mod (string-to-number (org-table-get-constant $1)))
  #+TBLFM: @4$3='(calc-dnd-mod (string-to-number (org-table-get-constant $1)))
  #+TBLFM: @8$3='(calc-dnd-mod (string-to-number (org-table-get-constant $1)))
  #+TBLFM: @9$3='(calc-dnd-mod (string-to-number (org-table-get-constant $1)))
  #+TBLFM: @15$3='(calc-dnd-mod (string-to-number (org-table-get-constant $1)))
  #+TBLFM: @21$3='(calc-dnd-mod (string-to-number (org-table-get-constant $1)))
  #+TBLFM: @2$5..@3$5='(concat "1d20 + " (number-to-string (+ (calc-dnd-pb $PROF $4) (calc-dnd-mod (string-to-number (org-table-get-constant @2$1))))))
  #+TBLFM: @4$5..@7$5='(concat "1d20 + " (number-to-string (+ (calc-dnd-pb $PROF $4) (calc-dnd-mod (string-to-number (org-table-get-constant @4$1))))))
  #+TBLFM: @8$5..@8$5='(concat "1d20 + " (number-to-string (+ (calc-dnd-pb $PROF $4) (calc-dnd-mod (string-to-number (org-table-get-constant @8$1))))))
  #+TBLFM: @9$5..@14$5='(concat "1d20 + " (number-to-string (+ (calc-dnd-pb $PROF $4) (calc-dnd-mod (string-to-number (org-table-get-constant @9$1))))))
  #+TBLFM: @15$5..@20$5='(concat "1d20 + " (number-to-string (+ (calc-dnd-pb $PROF $4) (calc-dnd-mod (string-to-number (org-table-get-constant @15$1))))))
  #+TBLFM: @21$5..@25$5='(concat "1d20 + " (number-to-string (+ (calc-dnd-pb $PROF $4) (calc-dnd-mod (string-to-number (org-table-get-constant @21$1))))))

* Stats
| Walking Speed | Flying speed | Climbing Speed | Hit Points | AC            | Death Saves | Inspiration |
|---------------+--------------+----------------+------------+---------------+-------------+-------------|
|            30 |           30 |             15 | 121/121    | 13 (16 w M.A) |             |             |

| Skill           | Ability | Prof | Mod | Roll      |
|-----------------+---------+------+-----+-----------|
| Acrobatics      | DEX     |      |   0 | 1d20 + 0  |
| Animal Handling | WIS     |      |   0 | 1d20 + 0  |
| Arcana          | INT     |      |   0 | 1d20 + 0  |
| Athletics       | STR     |      |  -1 | 1d20 + -1 |
| Deception       | CHA     |      |   0 | 1d20 + 0  |
| History         | INT     |      |   0 | 1d20 + 0  |
| Insight         | WIS     |      |   0 | 1d20 + 0  |
| Intimidation    | CHA     |      |   0 | 1d20 + 0  |
| Investigation   | INT     |      |   0 | 1d20 + 0  |
| Medicine        | WIS     |      |   0 | 1d20 + 0  |
| Nature          | INT     |      |   0 | 1d20 + 0  |
| Perception      | WIS     |      |   0 | 1d20 + 0  |
| Performance     | CHA     |      |   0 | 1d20 + 0  |
| Persuasion      | CHA     |      |   0 | 1d20 + 0  |
| Religion        | INT     |      |   0 | 1d20 + 0  |
| Sleight of Hand | DEX     |      |   0 | 1d20 + 0  |
| Stealth         | DEX     |      |   0 | 1d20 + 0  |
| Survival        | WIS     |      |   0 | 1d20 + 0  |
#+TBLFM: $5='(concat "1d20 + " $4)

* Attacks
  #+NAME: attacks
  | Weapon          | Ability | PB | Type                          | Die | Mod To Hit | Roll    |
  |-----------------+---------+----+-------------------------------+-----+------------+---------|
  | Crossbow, Light | DEX     |    | Piercing                      | 1d8 |          3 | 1d8 + 3 |
  | Dagger          | DEX     |    | Finesse, Light, Thrown(20/60) | 1d4 |          3 | 1d4 + 3 |
  | Shortsword      | DEX     |    | Piercing                      | 1d6 |          3 | 1d6 + 3 |
  #+TBLFM: $6='(+ (calc-dnd-pb $PROF $3) (calc-dnd-mod (string-to-number (org-table-get-constant $2))))
  #+TBLFM: $7='(concat $5 " + " (number-to-string (calc-dnd-mod (string-to-number (org-table-get-constant $2)))))

* Constants
  #+NAME: define-constants-with-src-block
  #+BEGIN_SRC elisp :var table=stats :colnames yes :results output drawer :cache yes :lang elisp
    (dnd-output-ability-constants table)
    #+END_SRC

    #+RESULTS[87ad1d0bfe6e86e226ace44824ec4d05b899ea9a]: define-constants-with-src-block
    :results:
    #+CONSTANTS: STR=9
    #+CONSTANTS: DEX=16
    #+CONSTANTS: CON=19
    #+CONSTANTS: INT=11
    #+CONSTANTS: WIS=11
    #+CONSTANTS: CHA=20
    #+CONSTANTS: PROF=4
    :end:

* Attacks
  #+NAME: attacks
  | Weapon         | Ability | PB | Type     | Die | Mod To Hit | Roll    |
  |----------------+---------+----+----------+-----+------------+---------|
  | Dagger         | DEX     |    | Piercing | 1d8 |          3 | 1d8 + 3 |
  | Light Crossbow | DEX     |    | Piercing | 1d6 |          3 | 1d6 + 3 |
  #+TBLFM: $6='(+ (calc-dnd-pb $PROF $3) (calc-dnd-mod (string-to-number (org-table-get-constant $2))))
  #+TBLFM: $7='(concat $5 " + " (number-to-string (calc-dnd-mod (string-to-number (org-table-get-constant $2)))))

